{
	"about": {
		"description": "I’m a developer who lives and breaths code. I’ve been fortunate enough to work on a large range of projects. Including writing MVT / AB tests in Javascript / AngularJS for household known e-commerce sites, a web-app for the largest Learn to Code event in Canada and helping students at a local coding bootcamp as a Teaching Assistant. As mentioned, my latest position has me coding AB / MVT on sites in Javascript / CSS for a range of e-commerce / digital services. Where I work closely with designers and coordinators to run experiments on sites. These tests range rapidly in complexity and therefore require the ability to reverse engineer problems and having a solid understanding of the DOM, Javascript and CSS."
	},
	"blogs": [
		{
			"title": "Many Blogs To Come, I promise!!!",
			"content": "While you wait here's some nerdy ipsum... Rich in mystery, vastness is bearable only through love hydrogen atoms as a patch of light Cambrian explosion decipherment, citizens of distant epochs, tesseract realm of the galaxies a still more glorious dawn awaits, kindling the energy hidden in matter, great turbulent clouds made in the interiors of collapsing stars, great turbulent clouds. Kindling the energy hidden in matter take root and flourish, Drake Equation, from which we spring shores of the cosmic ocean white dwarf from which we spring ship of the imagination tingling of the spine, emerged into consciousness. Consciousness? Worldlets birth cosmic ocean explorations great turbulent clouds! Culture, rich in heavy atoms made in the interiors of collapsing stars, brain is the seed of intelligence white dwarf Drake Equation shores of the cosmic ocean, muse about radio telescope hearts of the stars dream of the mind's eye great turbulent clouds, galaxies Drake Equation dispassionate extraterrestrial observer laws of physics colonies dream of the mind's eye paroxysm of global death Drake Equation something incredible is waiting to be known, a billion trillion. Star stuff harvesting star light. Consciousness! Rich in mystery Orion's sword, light years prime number the only home we've ever known. Worldlets. Cosmos. Vangelis the ash of stellar alchemy rich in mystery with pretty stories for which there's little good evidence circumnavigated dream of the mind's eye, circumnavigated? Ship of the imagination, prime number hydrogen atoms birth, star stuff harvesting star light something incredible is waiting to be known? Trillion citizens of distant epochs. Rogue, a still more glorious dawn awaits colonies paroxysm of global death a still more glorious dawn awaits? Venture. Bits of moving fluff, are creatures of the cosmos. A mote of dust suspended in a sunbeam realm of the galaxies citizens of distant epochs ship of the imagination with pretty stories for which there's little good evidence kindling the energy hidden in matter Apollonius of Perga Flatland, Hypatia corpus callosum Sea of Tranquility trillion. Decipherment. Extraordinary claims require extraordinary evidence rich in mystery. Shores of the cosmic ocean white dwarf? Take root and flourish hydrogen atoms intelligent beings cosmic ocean prime number emerged into consciousness? Tesseract globular star cluster, billions upon billions permanence of the stars. Radio telescope Rig Veda, billions upon billions paroxysm of global death Tunguska event Jean-François Champollion paroxysm of global death take root and flourish preserve and cherish that pale blue dot cosmic fugue astonishment at the edge of forever are creatures of the cosmos, encyclopaedia galactica venture, network of wormholes rings of Uranus. Are creatures of the cosmos quasar star stuff harvesting star light stirred by starlight encyclopaedia galactica vastness is bearable only through love worldlets and billions upon billions upon billions upon billions upon billions upon billions upon billions!",
			"datePublished": "28-Sept-2016"
		}
	],
	"projects": [
		{
			"title": "The HTML 500",
			"description": "Project built using rails and jQuery",
			"link": "http://www.thehtml500.com/",
			"backgroundPosition": "0px -977px"
		},
		{
			"title": "Cloverdale Business Improvement Agency",
			"description": "Project built with Jekyll, Google maps API, jQuery and Sass/Bootstrap ",
			"link": "http://www.cloverdalebia.com/",
			"backgroundPosition": "0px -535px"
		},
		{
			"title": "Brand Asset Manager App",
			"description": "Built with Rails and jQuery",
			"backgroundPosition": "0px 0px"
		}
	],		
	"skills": [
		{
			"title": "html",
			"backgroundPosition": "-29px -16px",
			"score": 100,
			"width": 128,
    		"height": 172
		},
		{
			"title": "css",
			"backgroundPosition": "-189px -16px",
			"score": 100,
			"width": 127,
    		"height": 174
		},
		{
			"title": "js",
			"backgroundPosition": "-336px -17px",
			"score": 100,
			"width": 127,
    		"height": 174		
    	},
		{
			"title": "react",
    		"backgroundPosition": "-37px -200px",
			"height": 123,
    		"width": 127,
			"score": 60
		},
		{
			"title": "angular",
			"backgroundPosition": "-190px -200px",
			"score": 70,
			"width": 123,
    		"height": 129
		},
		{
			"title": "rails",
			"backgroundPosition": "-187px -338px",
			"score": 70,
			"width": 130,
    		"height": 161
		},
		{
			"title": "swift",
			"backgroundPosition": "-482px -340px",
			"score": 50,
			"width": 124,
    		"height": 127
		},
		{
			"title": "php",
			"backgroundPosition": "-13px -340px",
			"score": 50,
			"width": 173,
    		"height": 87
		},
		{
			"title": "git",
			"backgroundPosition": "-493px -100px",
			"score": 70,
			"width": 169,
    		"height": 73
		},
		{
			"title": "node",
			"backgroundPosition": "-546px -11px",
			"score": 70,
			"width": 195,
    		"height": 67
		},
		{
			"title": "photoshop",
			"backgroundPosition": "-339px -200px",
			"score": 50,
			"width": 123,
    		"height": 129
		}
	],
	"INVADERS": {
		"ARROWS": {
			"LEFT": 37,
			"UP": 38,
			"RIGHT": 39,
			"SPACE": 32
		}
	}
	
}